Revit 2027 API
ExtrusionAnalyzerFaceAlignment Enumeration
 Indicates whether a face of the Solid analyzed by ExtrusionAnalyzer is fully aligned, partially aligned, or unaligned with faces of the extrusion.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum ExtrusionAnalyzerFaceAlignment
Public Enumeration ExtrusionAnalyzerFaceAlignment
public enum class ExtrusionAnalyzerFaceAlignment
type ExtrusionAnalyzerFaceAlignment
Members
Member name | Value | Description
FullyAligned | 0 |  The face is fully aligned with faces of the extrusion.
PartiallyAligned | 1 |  The face is only partially aligned with faces of the extrusion.
Unaligned | 2 |  The face is not aligned with any faces of the extrusion.
See Also
Reference
Autodesk.Revit.DB Namespace